netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/esb_attach_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.netsuite">
    <soapenv:Header></soapenv:Header>
    <soapenv:Body>
        <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
        <urn:method>attach</urn:method>
        <urn:warningAsError></urn:warningAsError>
        <urn:disableMandatoryCustomFieldValidation></urn:disableMandatoryCustomFieldValidation>
        <urn:disableSystemNotesForCustomFields></urn:disableSystemNotesForCustomFields>
        <urn:ignoreReadOnlyFields></urn:ignoreReadOnlyFields>
        <urn:partnerId></urn:partnerId>
        <urn:applicationId></urn:applicationId>
        <urn:email>%s(email)</urn:email>
        <urn:password>%s(password)</urn:password>
        <urn:account>%s(account)</urn:account>
        <urn:roleInternalId></urn:roleInternalId>
        <urn:roleExternalId></urn:roleExternalId>
        <urn:roleType></urn:roleType>
        <urn:roleName></urn:roleName>
        <urn:attachReferece>
            <attachReferece xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns1:AttachContactReference"
                            xmlns:ns1="urn:core_2014_1.platform.webservices.netsuite.com">
                <ns1:attachTo internalId="%s(attachCustomerInternalId)" type="customer" xsi:type="ns1:RecordRef">
                    <ns1:name xsi:type="xsd:string">Acera</ns1:name>
                </ns1:attachTo>
                <ns1:contact internalId="%s(attachContactInternalId)" xsi:type="ns1:RecordRef"/>
                <ns1:contactRole internalId="-10" xsi:type="ns1:RecordRef">
                    <ns1:name xsi:type="xsd:string">Primary Contact</ns1:name>
                </ns1:contactRole>
            </attachReferece>
        </urn:attachReferece>
    </soapenv:Body>
</soapenv:Envelope>
